Revit 2027 API
PrintParameters.MarginType Property
 The print margin type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MarginType MarginType { get; set; }
Public Property MarginType As MarginType
	Get
	Set
public:
property MarginType MarginType {
	MarginType get ();
	void set (MarginType value);
}
member MarginType : MarginType with get, set
Property Value
MarginType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Thrown when the input argument is out of range.
InvalidOperationException |  Thrown if the PaperPlacement is not Margins type.
See Also
Reference
PrintParameters Class
Autodesk.Revit.DB Namespace